SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( DEE_BOB_34052-L15
Type ( Engine )
WagonShape ( DEE_BOB_34052.s )
Size  ( 2.710m 4.002m 13.581m )
Name ( "DEE_BOB_34052 lamps 15" )

Include ( ..\\Common_Locomotives\\SR_BOB-WC_wagon.inc )

Comment ( ******************** Freight and Load Animations (If used) ********************
                Included in this section - Freight Animation information, etc
          *********************************************************************** )

ORTSFreightAnims (

FreightAnimStatic (
SubType( Default )
Shape ( pcrew.S )
Offset( 0 0 0 ) )

)


Comment ( ************************ Lights (If used) ************************
            Included in this section - Type, Colour, Location, Size, Control, etc
          *********************************************************************** )

  Lights ( 13

 Comment ( SR 1944 Headcode 15 - Lamp 04 and Lamp 06 )

  Light (
   comment( Head light 04 )
    Type  ( 0 )
    Conditions (
    Headlight ( 0 )
    Unit ( 2 )

    )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 2
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( 1.05 1.51 6.20 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 )
    )
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( 1.05 1.51 6.20 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 ) ) ) )

  Light (
   comment( Head light 06 )
    Type  ( 0 )
    Conditions (
    Headlight ( 0 )
    Unit ( 2 )

    )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 2
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( -1.02 1.51 6.20 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 )
    )
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( -1.02 1.51 6.20 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 ) ) ) )



  Light (
   comment( Chimney Sparks RS1AA ) 
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   TimeOfDay ( 0 )
   Weather ( 0 )
   Coupling ( 0 )  
   )
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 29 
   State (
   Duration ( 0.2 )
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.9 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   )
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.1 3.9 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1.50 ) 
   )
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.9 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.42 3.9 )

   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.35 )
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.72 3.9 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.30 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.52 3.9 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.72 3.9 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.92 3.9 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.30 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.32 3.9 )
  
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.52 3.9 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.92 3.9 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.26 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.35 3.9 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.55 3.9 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.5 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.9 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.30 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.9 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.9 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.9 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 7.22 3.9 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.9 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.9 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.9 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.9 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.9 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.9 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.9 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.9 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.33 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 3.9 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.9 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.3 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 9.22 3.9 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.30 ) 
                  )
            )
      )

  Light (
   comment( Gauge glass Lamp )
   Type ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ffe610 )
   Position ( 0.17 3.3 -5.55 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 0.25 )
     )
    )
   )

     
  Light (
   comment( Sphere of light for Exhaust )
   Type  ( 1 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   Cycle  ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ffe610 )
   Position ( 0 10.0 -14.45 )
   Transition ( 0 )
   Radius ( 6.0 )
   Angle ( 90.0 )
                               )
                         )
         )
  Light (
   comment( Inside Cab Glare )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle  ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( 0 2.50 -6.35 )
   Azimuth ( 0.0 -5.0 5.0 )
   Transition ( 0 )
   Radius ( 2.0 )
   Elevation ( -25 -25 -25 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( 0 2.50 -6.35 )
   Azimuth ( 0.0 -5.0 5.0 )
   Transition ( 0 )
   Radius ( 2.75 )
   Elevation ( -25 -25 -25 )
     )
    )
   )
  Light (
   comment( Inside Cab Glare Back )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle  ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( 0 2.50 -6.35 )
   Azimuth ( -180 -180 -180  )
   Transition ( 0 )
   Radius ( 2.75 )
   Elevation ( -25 -25 -25 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( 0 2.50 -6.35 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 2.0 )
   Elevation ( -25 -25 -25 )
    )
    
   )
  )
   
  Light (
   comment( Flickering Ashpan Front )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.63 -2.6 )
   Azimuth ( -90 -90 -90 )
   Transition ( 0 )
   Radius ( 1.4 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.63 -2.6 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.4 )
         
     )
    )
   )

  Light (
   comment( Flickering Ashpan Front )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.6 -2.6 )
   Azimuth ( 45 45 45 )
   Transition ( 0 )
   Radius ( 1.45 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.6 -2.6 )
   Azimuth ( 180 180 180 )
   Transition ( 0 )
   Radius ( 1.45 )
         
     )
    )
   )

  Light (
   comment( Flickering Ashpan Front )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.6 -2.6 )
   Azimuth ( 180 180 180 )
   Transition ( 0 )
   Radius ( 1.4 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.6 -2.6 )
   Azimuth ( 180 180 180 )
   Transition ( 0 )
   Radius ( 1.4 )
         
     )
    )
   )

  Light (
   comment( Flickering Ashpan Front Leading )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle  ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.64 -2.6 )
   Azimuth ( 0.0 -5.0 5.0 )
   Transition ( 0 )
   Radius ( 1.4 )
   Elevation ( -10 -10 -10 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.64 -2.6 )
   Azimuth ( 0.0 -5.0 5.0 )
   Transition ( 0 )
   Radius ( 1.4 )
   Elevation ( -10 -10 -10 )
     )
    )
   )

  Light (
   comment( Flickering Ashpan Back )
   Type  ( 0 )
   Conditions (
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.45 -4.2 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.4 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.45 -4.2 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.4 )
         
     )
    )
   )
  Light (
   comment( Ashpan flashes ) 
   Type ( 0 ) 
   Conditions ( 
   Headlight ( 3 ) 
   Unit ( 0 ) 
   ) 
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 28 
   State ( 
   Duration ( 1 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 01.4 -5.7 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.4 -5.7 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -54.7 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -54.7 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 5 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 5 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 3 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 5 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 5 ) 
   ) 
   State ( 
   Duration ( 5 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 5 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -5.7 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) ) ) )
 )

Comment (*Headlights add as appropriate

 Light (
   comment( Head light 01 )
    Type  ( 0 )
    Conditions (
    Headlight ( 0 )
    Unit ( 2 )
    TimeofDay ( 2 )
    )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 2
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( 0.01 3.75 5.45 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 )
    )
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( 0.01 3.75 5.45 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 ) ) ) )
 
   Light (
   comment( Head light 02 )
    Type  ( 0 )
    Conditions (
    Headlight ( 0 )
    Unit ( 2 )
    TimeofDay ( 2 )
    )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 2
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( 1.1625 2.45 5.5135 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 )
    )
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( 1.1625 2.45 5.5135 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 ) ) ) )

  Light (
   comment( Head light 03 )
    Type  ( 0 )
    Conditions (
    Headlight ( 0 )
    Unit ( 2 )
    TimeofDay ( 2 )
    )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 2
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( -1.1625 2.45 5.5135 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 )
    )
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( -1.1625 2.45 5.5135 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 ) ) ) )

  Light (
   comment( Head light 04 )
    Type  ( 0 )
    Conditions (
    Headlight ( 0 )
    Unit ( 2 )
    TimeofDay ( 2 )
    )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 2
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( 1.05 1.51 6.20 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 )
    )
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( 1.05 1.51 6.20 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 ) ) ) )

  Light (
   comment( Head light 05)
    Type  ( 0 )
    Conditions (
    Headlight ( 0 )
    Unit ( 2 )
    TimeofDay ( 2 )
    )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 2
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( 0.0 1.51 6.20 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 )
    )
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( 0.0 1.51 6.20 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 ) ) ) )

  Light (
   comment( Head light 06 )
    Type  ( 0 )
    Conditions (
    Headlight ( 0 )
    Unit ( 2 )
    TimeofDay ( 2 )
    )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 2
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( -1.02 1.51 6.20 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 )
    )
    State (
    Duration ( 0.05 )
    LightColour ( ffffffff )
    Position ( -1.02 1.51 6.20 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 0.215 )
    Elevation ( -10 -10 -10 ) ) ) )

    *)

Comment ( ********************* Wagon Visual Effects *********************
                      Included in this section - Effect type, etc
*********************************************************************** )

Effects(
SpecialEffects(

Comment( Steam Heating Hose Leak )
HeatingHoseFX(
-0.3 0.4 6.3
0 -0.2 -0.1
0.16 )

 ) )



 )


Engine ( DEE_BOB_34052  
Effects (
SteamSpecialEffects (

WhistleFX (
0 3.762 -0.557
0 -0.1 1.05
0.3 )

SafetyValvesFX (
0.169 4.030 -2.070
0 0.95 0
0.2 )
SafetyValvesFX (
-0.169 4.030 -2.070
0 -0.8 0
0.35 )

StackFX (
0 4.040 3.851
0 0.95 0
0.3 )
StackFX (
0 4.040 3.851
0 0.95 0
0.25 )
StackFX (
0 4.040 3.851
0 0.95 0
0.25 )

DrainpipeFX (
-1.5 1.258 -3.886
-0.4 -1 -0.2
0.05 )

CylindersFX (
-0.854 0.587 6.658
0 -0.4 1.4
0.1 )
Cylinders2FX (
0.854 0.587 6.658
0 -0.4 1.4
0.1 )
Cylinders2FX (
-0.45 0.587 6.658
0 -0.4 1.4
0.1 )
Cylinders2FX (
-0.854 0.577 6.648
0 -0.4 1.4
0.1 )
CylindersFX (
0.854 0.577 6.648
0 -0.4 1.4
0.1 )
CylindersFX (
-0.45 0.577 6.648
0 -0.4 1.4
0.1 )

Injectors1FX (
-1.05 0.15 -6.60
0 -0.5 -1
0.08 )
Injectors2FX (
1.05 0.15 -6.60
0 -0.5 -1
0.08 )

SteamBrakeFX (
0.65 0.80 -3.5
0 -1 0
0.05 )
SteamBrakeFX (
-0.65 0.80 -3.5
0 -1 0
0.05 )

) )


Include ( ..\\Common_Locomotives\\SR_BoB-WC_engine.inc )

HeadOut (  -1.45 3.1 -6.15 )

Description (

"Bulleid_Light_Pacific_34052_BR"

)
EngineOperatingProcedures (
"To move forward\n"+
"1.Press the W key several times to move the Reverser to full Forward.\n"+
"2.Press the ; (SEMICOLON) key to release the train brakes.\n"+
"3.Press the D key to increase the Regulator setting.\n"+  
"4.As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
"To slow the train\n"+
"1.Press the A key to move the Regulator to a lower setting.\n"+
"2.Use the brakes to further reduce speed if desired.\n\n"+
"To apply the train brakes\n"+
"1.Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
"2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
"To release the train brakes\n"+
"1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
"2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
"To back up\n"+
"1.Bring your train to a full stop.\n"+ 
"2.Press the S key several times to move the Reverser to the full Reverse position.\n"+
"4.Press the ; (SEMICOLON) key to release the brakes.\n"+
"5.Slowly advance the regulator (D key).\n\n"+
"To load and unload passengers\n"+
"1. Stop at a station.\n"+
"2. Press the ENTER key.\n"+
"3. Wait for the \"permission to depart\" whistle.\n"+
"TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
"To couple to a car or locomotive\n"+
"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
"TIP: To use the Coupling view, press the 6 key.\n"+
"2. Press F9 to open the Train Operations window.\n"+
"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
"4. Close the Train Operations window.\n\n"+
"To uncouple from a car or locomotive\n"+
"1. Press F9 to open the Train Operations window.\n"+
"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
"4. Close the Train Operations window.\n\n"+
"Firing commands (Automatic Fireman OFF in Options screen)\n"+
"To add coal to the firebox\n"+
"1. Press the F key to open the Firebox door.\n"+
"2. Press the R key to increase the shoveling rate.\n\n"+
"To stop adding coal to the fire\n"+
"1. Press SHIFT+R to decrease the shoveling rate.\n"+
"2. Press SHIFT+F to close the firebox door.\n\n"+
"To operate the blower\n"+
"1.Press the N key to increase the blower.\n"+
"2. Press SHIFT+N to decrease the blower.\n\n"+
"To operate the dampers\n"+
"1.Press the M key to open the dampers.\n"+
"2. Press SHIFT+M to close the dampers.\n\n"+
"To inject water into the boiler\n"+
"1.Press the I key to turn on the steam to Injector 1.\n"+
"(You can also press the O key to turn on the steam to Injector 2.)\n"+
"2.Press the K key to increase the water flow to Injector 1.\n"+
"(To increase the water flow to Injector 2, press the L key.)\n\n"+
"To stop boiler water injection\n"+ 
"1. Press the I key to turn off the steam to Injector 1.\n"+
"2. Press the O key to turn off the steam to Injector 2."
)
)